# x = 239 // 23 - целочисленное деление
# x = 5 ** 3    - возведение в степень
# x = 5e - 1    - 0.5
# int(x)        - преобразование к целому числу
# float(x)      - преобразование к числу с плавуещей точкой
# type(x)       - узнать тип объекта

#  input()      - читает строку с клавиатуры
#  input('введите данные')      - выводит сообщение и потом читает строку с клавиатуры
#  s = input()
#  a = int(input())

# x or y, x and y, not x - логические операции с bool

# if a > b :
#     print(a)
# elif a < b :
#     print('b')
# else:
#     print(b)

# 'abc' + 'def'
# 'abcdef'
# 'abc' * 3
# 'abcabcabc'
# len('abc')
# 3

# 'abc' < 'ac' - true - сранение лексиграфически

# a = 5
# while a > 0:
#     print(a, end=' ') # end= - разделить пробелом
#     a -= 1



x = 2014 ** 14
print(x)
